"""
======================
Author: 柠檬班-小简
Time: 2020/8/31 21:37
Project: day4
Company: 湖南零檬信息技术有限公司
======================
"""
"""
前置：登陆

"""

class TestInvest:

    def test_invest_success(self):
        # 前置 - 步骤  - 断言
        # 1、首页 - 选择第1个标，点击抢投标按钮
        # 2、标页面 - 获取用户的  投资前的余额
        # 2、标页面 - 获取标的 投资前的标余额
        # 2、标页面 - 输入投资金额2000，点击投资按钮。
        # 3、标页面 - 点击查看并激活

        # 1、用户的钱少了没有
        # 投资之前 - 投资之后 = 2000
        # 用户页面 - 得到用户当前余额
        # 2、标的可投余额少了没有
        # 标前 - 标后 = 2000
        # 用户页面 - 回退一次
        # 刷新页面，
        # 标页面 - 获取投资后的标余额
        pass
