"""
======================
Author: 柠檬班-小简
Time: 2020/6/10 20:03
Project: py30
Company: 湖南零檬信息技术有限公司
======================
"""

"""
1.编写如下程序
编写一个工具箱类和工具类

工具类：需要有工具具的名称、功能描述、价格。
工具箱类：能够添加工具、删除工具、查看工具，并且能获取工具箱中工具的总数。
        添加、删除、查看 、获取工具总数。
        属性: tools = []
        def __init__(self):
            self.tools = []
        
        添加：def add_tool(self,tool):
                self.tools.append(tool)
            

实例化几个工具。并在工具箱对象当中做添加/删除/查看工具操作，获取工具箱对象中有几个工具。

工具比如锤子、斧头、螺丝刀等工具。

提示：不需要用到继承。

"""